Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཡོངས་སུ་གཟུང་བ་ཐམས་ཅད་ཀྱི་དོར་ལྟ་བ་མི་འདོད་པར་འགྱུར་ཏེ། དེ་སྐྱེས་ནས་འདོད་པ་ལ་མ་རྩེས་པར་ན་ཚོད་གཞོན་ནུར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བསྟན་པ་ལ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་མྱུར་དུ་རབ་ཏུ་འབྱུང་ངོ་། ། དེ་དད་པས་རབ་ཏུ་བྱུང་ནས་དགེ་བའི་བཤེས་གཉེན་མཆོག་དང་ལྡན་ཞིང་དགེ་བའི་བཤེས་གཉེན་དང་འགྲོགས་དགེ་བའི་བཤེས་གཉེན་ལ་རྟོག་པས་དགེ་བའི་བསམ་པ་རྙེད་པར་འགྱུར་རོ། ། དེ་དགེ་བའི་བསམ་པ་དང་ལྡན་པས་དགེ་བའི་ཆོས་རྣམས་ཉན་ཅིང་སྒྲུབ་པ་སྙིང་པོར་བྱེད་པར་འགྱུར་ཏེ། ཚིག་ལྷུར་བྱེད་པའི་བློ་དང་ལྡན་པར་མི་འགྱུར། མང་དུ་ཐོས་པ་ཡོངས་སུ་ཚོལ་བས་ངོམས་པར་མི་འགྱུར། ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ། ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ལ་མི་རེ་ཞིང་རང་གི་ཚིག་ཡོངས་སུ་མི་སྤོང་བར་གཞན་ལ་ཆོས་སྟོན་ཏེ། ཇི་ལྟར་ཐོས་པ་དང་། ཇི་ལྟར་གནས་པ་དེ་བཞིན་དུ་གཞན་ལ་ཆོས་སྟོན་ཏོ། ། ཆོས་ཉན་པ་རྣམས་ལ་བྱམས་པ་ཆེན་པོ་རྙེད་པར་འགྱུར། སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་འཇུག་པར་འགྱུར་རོ། ། དེ་མང་དུ་ཐོས་པས་ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་འགྱུར། འདོད་པ་ཉུང་ཞིང་ཆོག་ཤེས་པར་འགྱུར། རབ་ཏུ་དབེན་པ་དང་། ངེས་པར་འགྱུར། གསོ་སླ་བ་དང་། དགང་སླ་བ་དང་། དགོན་པ་ལ་དགའ་བ་དང་། ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་ཀྱི་དོན་ལ་ཉེ་བར་རྟོག་པ་དང་། དོན་ལ་རྟོན་གྱི་ཡི་གེ་ལ་མི་རྟོན་པ་ཡིན། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་རྟེན་དུ་འགྱུར། བདག་འབའ་ཤིག་གི་ཕྱིར་ཞུགས་པ་མ་ཡིན་གྱི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕྱིར་འདི་ལྟ་སྟེ། ཐེག་པ་ཆེན་པོ་བླ་ན་མེད་པ་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་མི་མཉམ་པ་དང་། མཉམ་པའི་ཡེ་ཤེས་འཇིག་རྟེན་གསུམ་པོ་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པའི་ཡེ་ཤེས་ཡོངས་སུ་ཚོལ་ལོ། །
en: “Soon after he is born he stops running after the pleasures of the senses, and in his adolescence he develops faith in the teachings of the lords, the buddhas, leaves his home behind, and becomes a renunciant. Having developed faith and become a renunciant, he seeks out a truly spiritual friend, stays with this spiritual friend, keeps his attention directed toward his spiritual friend, and develops virtuous intention. He then listens to the good teachings with this virtuous intention and takes their practices to heart. He is not someone who takes an intellectual delight in the teachings. The search for great knowledge does not satisfy him. He elucidates the teachings to many others in exactly the same manner as he has heard them. With no desire for material reward, he teaches the Dharma to others, not seeking honor or praise. He avoids his own words and teaches the Dharma to others just as he has heard it, in a way that is appropriate to the circumstances. He develops great love for those who listen to the Dharma. He engages with all sentient beings with great compassion. Since he has great learning, he is not concerned with his body or his life. He is content because he has few desires. He is a hermit and his nature is gentle. He is easily supported, does not require much, and prefers the wilderness. He understands the meaning of the teachings just as he has heard them, and he does not rely on the words but on the meaning. He is a support for the world with its gods, humans, and asuras. He is engaged not just for his own benefit but for the benefit of all beings, seeking the unsurpassed Mahāyāna, the knowledge of the buddhas, the unparalleled knowledge, the knowledge that is unlike anything in the threefold world.

source: བག་ཡོད་པ་ལྷུར་བྱེད་པར་འགྱུར་ཏེ། དེ་ལ་བག་ཡོད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དབང་པོ་ཡང་དག་པར་སྡོམ་པའོ། ། དེ་ལ་དབང་པོ་ཡང་དག་པར་སྡོམ་པ་གང་ཞེ་ན། གང་མིག་གིས་གཟུགས་མཐོང་ནས་མཚན་མར་མི་འཛིན། མངོན་རྟགས་སུ་མི་འཛིན། གཟུགས་ལ་ཆགས་པ་དང་། ཉེས་དམིགས་དང་། འབྱུང་བ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། ། དེ་བཞིན་དུ་རྣ་བས་སྒྲ་དང་། སྣས་དྲི་དང་། ལྕེས་རོ་དང་། ལུས་ཀྱིས་རེག་བྱ་དང་། ཡིད་ཀྱིས་ཆོས་ཤེས་ནས་མཚན་མར་མི་འཛིན། མངོན་རྟགས་སུ་མི་འཛིན། ཆོས་རྣམས་ལ་ཆགས་པ་དང་། ཉེས་དམིགས་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་འདི་ནི་བག་ཡོད་པ་ཞེས་བྱའོ། །
en: “He is very careful. In what way is he careful? He has control over his senses. In what way does he have control over his senses? When he sees forms with his visual faculty he does not hold on to any attributes, does not hold on to any marks. He knows that the enjoyment, distress, and release related to form are nothing more than that. In the same way, when he hears sounds with his faculty of hearing, smells with his faculty of smell, tastes with his faculty of taste, experiences physical sensations with his faculty of touch, and experiences mental phenomena with his mental faculty, he does not hold on to any attributes, does not hold on to any marks. He knows truly as they are the enjoyment, distress, and release related to mental phenomena. This is what is meant by being careful.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བག་ཡོད་པ་ཞེས་བྱ་བ་ནི་གང་བདག་གི་སེམས་འདུལ་བ་དང་། གཞན་གྱི་སེམས་བསྲུང་བ་དང་། ཉོན་མོངས་པ་ལ་དགའ་བ་སྤོང་བ་དང་། ཆོས་ལ་དགའ་བའི་རྗེས་སུ་འགྲོ་བ་དང་། འདོད་པ་ལ་རྣམ་པར་རྟོག་པ་དང་། གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་རྣམས་མི་འབྱུང་བ་དང་། རྣམ་པར་འཚེ་བའི་རྣམ་པར་རྟོག་པ་རྣམས་མི་འབྱུང་བ་དང་། ཆགས་པའི་མི་དགེ་བའི་རྩ་བ་རྣམས་མི་འབྱུང་བ་དང་། ཞེ་སྡང་གི་མི་དགེ་བའི་རྩ་བ་རྣམས་མི་འབྱུང་བ་དང་། གཏི་མུག་གི་མི་དགེ་བའི་རྩ་བ་རྣམས་མི་འབྱུང་བ་དང་། ལུས་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་། ངག་གིས་ཉེས་པར་སྤྱོད་པ་དང་། ཡིད་ཀྱིས་ཉེས་པར་སྤྱོད་པ་མི་འབྱུང་བ་དང་། ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་མི་འབྱུང་བ་དང་། སྡིག་པ་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་མི་འབྱུང་བ་དེ་ནི་བག་ཡོད་པ་ཞེས་བྱའོ། །
en: “Furthermore, Śāriputra, carefulness is explained in this way. It is to have tamed one’s own mind and to be sensitive to the minds of others. It is to remove one’s inclination toward vices and to become inclined toward virtue. It is to not engage in greedy thoughts or malicious thoughts. It is to not engage in thoughts of harming others. It is to not engage in the unwholesome root of passion. It is to not engage in the unwholesome root of anger. It is to not engage in the unwholesome root of delusion. It is to not engage in negative physical actions, negative verbal actions, and negative mental actions. It is to not be concerned with what is not essential. It is to not engage in any negative, unwholesome behavior. This is what is meant by being careful.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་བག་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ལ་རབ་ཏུ་སྦྱོར་བ་ནི་གང་ཡོད་པ་དེ་ཡང་ཡོད་པར་རབ་ཏུ་ཤེས། གང་མེད་པ་དེ་ཡང་མེད་པར་རབ་ཏུ་ཤེས་སོ། ། དེ་ལ་ཅི་ཡོད་ཅི་མེད་ཅེ་ན། ཡང་དག་པ་ལ་རབ་ཏུ་སྦྱོར་བ་ལ་ནི་འཕགས་པའི་རྣམ་པར་གྲོལ་བ་ཡོད་དོ། ། ལོག་པ་ལ་རབ་ཏུ་སྦྱོར་བ་ལ་ནི་འཕགས་པའི་རྣམ་པར་གྲོལ་བ་མེད་དོ། ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་ཡོད་དོ། ། གང་གི་ལས་རྣམ་པར་སྨིན་པ་དེ་ནི་མེད་དོ། ། གཞན་ཡང་མིག་ནི་ཡོད་དོ། ། གང་གི་མིག་དེ་ནི་མེད་དོ། །རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ནི་ཡོད་དོ། ། གང་གི་ཡིད་དེ་ནི་མེད་དོ། ། གཞན་ཡང་གཟུགས་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། འགྱུར་བའི་ཆོས་ཅན་དེ་ནི་ཡོད་དོ། ། གཟུགས་རྟག་པ་དང་། བརྟན་པ་དང་། མི་འགྱུར་བའི་ཆོས་ཅན་དང་། ཐེར་ཟུག་པ་དང་། དེ་བཞིན་དུ་གནས་སོ་ཞེས་བྱ་བ་དེ་ནི་མེད་དོ། ། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། འགྱུར་བའི་ཆོས་ཅན་དེ་ནི་ཡོད་དོ། ། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་རྟག་པ་དང་། བརྟན་པ་དང་། ཐེར་ཟུག་པ་དང་། མི་འགྱུར་བའི་ཆོས་ཅན་དང་། ཡང་དག་པར་དེ་བཞིན་དུ་གནས་སོ་ཞེས་བྱ་བ་དེ་ནི་མེད་དོ། །
en: “So, Śāriputra, the careful bodhisatva applies himself to what are basic reflections. He will acknowledge that what is the case is the case. He will acknowledge that what is not the case is not the case. So what is the case, and what is not the case? There is noble liberation for one who practices correctly, but there is no noble liberation for one who practices incorrectly. There is ripening of the fruits of actions, but there is no one for whom there is ripening of the fruits of actions. Also, there is a visual faculty, but there is no one for whom there is a visual faculty. There is a faculty of hearing, a faculty of smell, a faculty of taste, a faculty of touch, and a mental faculty, but there is no one for whom there is a mental faculty. “Moreover, there is impermanence of the body, as well as suffering brought by it, it being subject to change, but there is no permanent body, no body that lasts, that is not subject to change, that is eternal, and that one can be certain will stay the way it is. There is impermanence of feeling, perception, mental conditioning, and consciousness, as well as the suffering they bring, their being subject to change, but there is no feeling, perception, mental conditioning, and consciousness that is permanent, that is lasting, that is not subject to change, that is eternal, and that one can be certain will remain exactly the way it is.

source: གཞན་ཡང་མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས་ཡོད་ཀྱི། མ་རིག་པ་མེད་ན། འདུ་བྱེད་མེད་པ་ནས་སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤིའི་བར་དུ་ཡོད་ཀྱི། སྐྱེ་བ་མེད་ན་རྒ་ཤི་མེད་དོ། ། གཞན་ཡང་སྦྱིན་པས་ལོངས་སྤྱོད་ཆེན་པོར་འགྱུར་བ་ནི་ཡོད་དོ། ། སྦྱིན་པས་དབུལ་པོར་འགྱུར་བ་ནི་མེད་དོ། ། ཚུལ་ཁྲིམས་ཀྱིས་མཐོ་རིས་སུ་སྐྱེ་བ་ནི་ཡོད་དོ། །
en: “Furthermore, there is arising of mental conditioning when the condition of ignorance is present, but there is no arising of mental conditioning when the condition of ignorance is not present. It is the same with the rest of the list, up to and including the fact that there is aging and death when the condition of birth is present, but there is no aging and death when the condition of birth is not present.

source: འཆལ་བའི་ཚུལ་ཁྲིམས་ཀྱིས་མཐོ་རིས་སུ་སྐྱེ་བ་ནི་མེད་དོ། ། ཐོས་པས་ཤེས་རབ་ཆེན་པོར་འགྱུར་བ་ནི་ཡོད་དོ། ། འཆལ་བའི་ཤེས་རབ་ཀྱིས་ཤེས་རབ་ཆེན་པོར་འགྱུར་བ་ནི་མེད་དོ། ། སྒོམ་པས་འབྲལ་བར་འགྱུར་བ་ནི་ཡོད་དོ། ། སྒོམ་པས་འབྲལ་བར་མི་འགྱུར་བ་ནི་མེད་དོ། ། ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པས་ཀུན་ཏུ་སྦྱོར་བ་ནི་ཡོད་དོ། ། ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པས་འབྲལ་བ་ནི་མེད་དོ། ། བརྩོན་འགྲུས་བརྩམས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་བྱང་ཆུབ་ཡོད་དོ། །ལེ་ལོ་ཅན་ལ་ནི་བྱང་ཆུབ་མེད་དོ། ། ང་རྒྱལ་མེད་པ་ལ་ནི་རབ་ཏུ་བྱུང་བར་ལུང་བསྟན་པ་ཡོད་དོ། ། ང་རྒྱལ་ཅན་ལ་ནི་མྱ་ངན་ལས་འདའ་བ་མེད་དོ། ། གཞན་ཡང་ཐམས་ཅད་དུ་སོང་བའི་སྟོང་པ་ཉིད་ནི་ཡོད་དོ། ། ལེ་ལོ་ལ་ནི་བདག་དང་། སེམས་ཅན་དང་། སྲོག་དང་། སྐྱེས་བུ་དང་། གང་ཟག་གོ་ཞེས་བྱ་བ་དེ་ནི་མེད་དོ། །
en: “Furthermore, generosity leads to great riches, but generosity does not lead to poverty. Morality leads to rebirth in the heavenly realms, while immorality does not lead to rebirth in the heavenly realms. Studying leads to great wisdom, while mistaken understanding does not lead to great wisdom. Meditation leads to disentanglement, but meditation does not lead to entanglement. Being concerned with what is superficial leads to entanglement, but it is not possible that being concerned with what is superficial leads to liberation. There is attainment of awakening for the bodhisatva who applies himself diligently, but there is no attainment of awakening for one who is lazy. One who is not conceited is destined for the life of a renunciant, but there is no attainment of nirvāṇa for the conceited.“Furthermore, emptiness is omnipresent, and there are no such entities as a self, a being, a life force, a person, or a human being.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་བག་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པ་ནི་གང་ཡོད་པར་འཇིག་རྟེན་གྱི་མཁས་པ་རྣམས་ཀྱིས་ཀུན་ཤེས་པ་དེ་ལ་ནི་ཡོད་དོ་ཞེས་འདོགས་སོ། ། གང་མེད་པར་འཇིག་རྟེན་ན་མཁས་པ་རྣམས་ཀྱིས་ཀུན་ཤེས་པ་དེ་ལ་ནི་མེད་དོ་ཞེས་འདོགས་སོ། ། དེ་ཡོད་ཅེས་ཐ་སྙད་དུ་འདོགས་པ་ལ་ཡང་ཡང་དག་པར་ཤེས་པར་མི་བྱེད། མེད་ཅེས་ཐ་སྙད་ཏུ་འདོགས་པ་ལ་ཡང་ཡང་དག་པར་ཤེས་པར་མི་བྱེད་དོ། ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་གསུངས་པའི་ཡང་དག་པའི་དོན་ཀྱང་ཁོང་དུ་ཆུད་དེ། ཆོས་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པས་བསྡུས་ཏེ་ཆོས་ཀྱི་མདོ་བཞིར་འདུས་པར་བྱས་སོ། །
en: “It is in this way that the careful bodhisatva applies himself to what is essential. Whatever the learned ones of the world agree on, they will consider that to be the case. Whatever the learned ones of the world do not agree on, they will not consider that to be the case. They say ‘This is the case’ and acknowledge it. They say ‘This is not the case’ and do not acknowledge it. “He internalizes the true meaning of the words of all the lords, the buddhas. When the Tathāgata summarizes all the teachings, they are gathered into four succinct statements.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་པ་དང་། འདུ་བྱེད་ཐམས་ཅད་སྡུག་བསྔལ་བ་དང་། ཆོས་ཐམས་ཅད་བདག་མེད་པ་དང་། མྱ་ངན་ལས་འདས་པ་ཞི་བའོ། ། འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་པ་ཞེས་བྱ་བ་ནི་རྟག་པར་འདུ་ཤེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་རྟག་པར་འདུ་ཤེས་པ་སྤང་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་བཤད་དོ། ། འདུ་བྱེད་ཐམས་ཅད་སྡུག་བསྔལ་བ་ཞེས་བྱ་བ་ནི་བདེ་བར་འདུ་ཤེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་བདེ་བར་འདུ་ཤེས་པ་སྤང་བའི་ཕྱིར། དེ་བཞིན་གཤེགས་པས་བཤད་དོ། ། ཆོས་ཐམས་ཅད་བདག་མེད་པ་ཞེས་བྱ་བ་ནི་བདག་ཏུ་འདུ་ཤེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་བདག་ཏུ་འདུ་ཤེས་པ་སྤོང་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་བཤད་དོ། ། མྱ་ངན་ལས་འདས་པ་ཞི་བ་ཞེས་བྱ་བ་ནི་དམིགས་པས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པའི་སེམས་ཅན་རྣམས་ཀྱི་དམིགས་པའི་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་སྤོང་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་བཤད་དོ། །
en: What are these four statements? They are that all conditioned things are impermanent, that all conditioned things bring suffering, that all phenomena are devoid of a self, and that nirvāṇa is peace. The Lord teaches that all conditioned things are impermanent so that any sentient beings who harbor the idea of permanence might rid themselves of the idea of permanence. The Lord teaches that all conditioned things bring suffering so that any sentient beings who harbor the idea of pleasure might rid themselves of the idea of pleasure. The Lord teaches that all phenomena lack a self so that any sentient beings who harbor the idea of a self might rid themselves of the idea of a self. The Lord teaches the peace of nirvāṇa so that any sentient beings who harbor erroneous apprehensions might rid themselves of these erroneous apprehensions.

source: དེ་འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་གོ་ཞེས་ཐོས་ནས་ཤིན་ཏུ་མི་རྟག་པ་ཉིད་ལ་འཇུག་གོ ། འདུ་བྱེད་ཐམས་ཅད་སྡུག་བསྔལ་བའོ། ། ཞེས་ཐོས་ནས་སྨོན་ལམ་དང་བྲལ་བ་སྐྱེད་དོ། ། ཆོས་ཐམས་ཅད་བདག་མེད་པའོ་ཞེས་ཐོས་ནས་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་ཐར་པའི་སྒོ་ལ་སྒོམ་མོ། ། མྱ་ངན་ལས་འདས་པ་ཞི་བ་ཞེས་ཐོས་ནས་མཚན་མ་མེད་པ་ཡོངས་སུ་འདྲིས་པར་བྱེད་དེ།
en: “When he hears that all conditioned things are impermanent, he understands impermanence thoroughly. When he hears that all conditioned things bring suffering, he becomes free from wishes. When he hears that all phenomena lack a self, he cultivates the way to liberation that is concentration on emptiness. When he hears of the peace of nirvāṇa he familiarizes himself with freedom from attributes and does not prematurely realize the ultimate goal.

source: དུས་མ་ཡིན་པར་ནི་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་མི་བྱེད་དོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་ལྟ་བུའི་ཆོས་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དགེ་བའི་ཆོས་ལས་ཡོངས་སུ་མི་ཉམས་ཏེ། མྱུར་དུ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: “It is for this reason, Śāriputra, that the bodhisatva who is truly intent on the Dharma will not give up the wholesome way of life and will swiftly master all the Buddha’s teachings.”

source: བྱང་ཆུབ་སེམས་དཔའ་བརྟག་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་གསུམ་པའོ།། །།
en: This is the third chapter, “The Examination of the Bodhisatva.”

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་ལྟར་དད་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་བསམ་གྱིས་མི་ཁྱབ་པའི་ཆོས་བཅུ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ནས་ངོ་མཚར་དང་རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྐུ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ནས། ངོ་མཚར་དང་རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། ། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་དབྱངས་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད་པ་ནས་ངོ་མཚར་དང་། རྨད་དུ་འདུ་ཤེས་སྐྱེད་པའི་བར་དུའོ། །འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་འོད་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས་རབ་ཏུ་རྟོག ། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ་རངས་པ་རྙེད་ནས་ངོ་མཚར་དང་རྨད་དུ་འདུ་ཤེས་སྐྱེད་པའོ། ། དེ་བཞིན་གཤེགས་པའི་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་བཅུ་པོ་འདི་རྣམས་ཀྱི་ཕྱིར་བརྩོན་འགྲུས་ཆེར་རྩོམ་ཞིང་མི་ཞུམ་མི་འགོང་མི་སྐྱོ་སྟེ། དེ་བཞིན་གཤེགས་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་བཅུ་པོ་མ་ཐོབ་ཀྱི་བར་དུ་ལུས་ཀྱི་པགས་པ་དང་རྒྱུས་པ་དང་པྲི་དང་། དབུགས་དང་རུས་པ་དག་ཞིག་ལ་ལུས་ཀྱི་ཤ་དང་ཁྲག་སྐམས་ཀྱང་སླའི། བརྩོན་འགྲུས་ཉམས་པར་མི་བྱའོ་སྙམ་དུ་དེ་ལྟར་སེམས་སྐྱེད་དོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་དད་པས་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་བཞིན་གཤེགས་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་བཅུ་པོ་འདི་རྣམས་ལ་མངོན་པར་དད། ཡིད་ཆེས་རབ་ཏུ་རྟོག ། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ་རངས་པ་རྙེད་དོ། །
en: “Now, Śāriputra, a bodhisatva with firm confidence has faith in the inconceivable tathāgata, the arhat, the fully accomplished Buddha, in respect of his ten qualities. He has trust and confidence and does not doubt him, and to an even greater degree he feels pleasure, joy, and satisfaction. What are these ten qualities? He has faith in the inconceivable body of the Tathāgata, he has trust and confidence, and he does not doubt it, and to an even greater degree he feels pleasure, joy, and satisfaction as he produces the concept of it as being truly wondrous and extraordinary. He has great faith, and so forth in the voice of the Tathāgata, as he produces the concept of it as being truly wondrous and extraordinary. He has faith in the knowledge of the Tathāgata, his inconceivable tathāgata radiance, his inconceivable tathāgata morality and concentration, his inconceivable magical tathāgata abilities, his inconceivable tathāgata power, his inconceivable tathāgata confidence, his inconceivable great compassion, and his inconceivable unique buddha qualities, he has trust and confidence and does not doubt it, and to an even greater degree he feels pleasure, joy, and satisfaction as he produces the concept of it as being truly wondrous and extraordinary. He sets forth with vigor, and he does not tire or become discouraged or intimidated in his pursuit of these ten inconceivable, wondrous and extraordinary qualities of the Tathāgata. He is so committed that even if his physical body with its sinews, muscles, skin, and bones were to rot, and even if his flesh and blood were to dry up, his vigor would not fail as long as he had not attained these ten inconceivable, wondrous, and extraordinary qualities of the Tathāgata. In this way, Śāriputra, the bodhisatva with faithful conviction has great faith in the inconceivable, truly wondrous and extraordinary qualities of the Tathāgata. He has trust and confidence and does not doubt it, and to an even greater degree he feels pleasure, joy, and satisfaction.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: Then, in order to clarify this further, the Lord spoke these verses:

source: སངས་རྒྱས་སྐུ་ནི་བསམ་མི་ཁྱབ། །
en: “The Buddha’s body is inconceivable,

source: ཆོས་ཀྱི་སྐུ་ཡིས་རབ་ཏུ་ཕྱེ། །
en: Illustriously embodying the Dharma;

source: མཚན་མ་མེད་ཅིང་སྣང་མེད་ལ། །རྒྱལ་བའི་ཐུགས་སྲས་དད་པར་བྱེད། །འགྲོ་བ་ཐ་དད་ཇི་སྙེད་ཀྱི། །
en: It is beyond attributes, beyond appearance, And the children of the Victorious One trust in this.

source: སྒྲ་སྐད་བསམ་གྱིས་མི་ཁྱབ་པ། །ཐམས་ཅད་དུ་ནི་ཆོས་སྒྲོགས་ཏེ། །སངས་རྒྱས་ཀྱི་ནི་སྤྱོད་ཡུལ་དང་། །ཇི་ཙམ་སེམས་ཅན་ཐམས་ཅད་ཀྱི། དུས་གསུམ་དག་གི་དབང་པོ་ཀུན། །སངས་རྒྱས་ཀྱིས་ནི་རབ་མཁྱེན་ཏེ། །
en: “The number of languages spoken By different beings is inconceivable. The Buddha expresses the Dharma in all of them, And he inspires faith wherever he speaks. “However many different abilities Sentient beings in the three times possess, The Buddha knows them all.

source: བསམ་མི་ཁྱབ་ལ་རབ་ཏུ་དད། །
en: Because of this inconceivable quality, they have faith in him.

source: སངས་རྒྱས་རྣམས་ཀྱི་འོད་མཐའ་ཡས། །འོད་ཟེར་དྲ་བ་བསམ་མི་ཁྱབ། །
en: “The radiance of the buddhas is limitless, An inconceivable net of rays

source: ཞིང་རྣམས་རྒྱ་མཚོ་མཐའ་ཡས་པ། །ཐམས་ཅད་ཀྱི་ནི་ཕྱོགས་སུ་ཁྱབ། །
en: Spreading in all ten directions Throughout the endless sea of fields.

source: ཐུབ་པའི་ཚུལ་ཁྲིམས་འཇིག་རྟེན་འདས། །
en: “The morality of the sage is transcendent

source: འཇིག་རྟེན་ཆོས་ལ་མི་གནས་ཏེ། །
en: And is not based on the customs of this world.

source: རྫུ་འཕྲུལ་རྐང་པ་བསམ་ཡས་ལ། །བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་དད། །
en: The bodhisatvas put their trust In the inconceivable foundations of his magical abilities.

source: སངས་རྒྱས་རྟག་ཏུ་མཉམ་པར་གཞག ། རྣམ་པར་ཐར་པ་བསམ་མི་ཁྱབ། །
en: “No sentient being Can understand the scope of the Buddha.

source: སངས་རྒྱས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ནི། །སེམས་ཅན་ཀུན་གྱིས་ཤེས་མི་ནུས། །
en: The Buddha’s concentration is unwavering, His liberation inconceivable.

source: ཆོས་ཀྱི་དབྱིངས་ནི་དབྱེར་མེད་ལ། །གང་གི་སྟོབས་ཀྱིས་ཤེས་འགྱུར་བ།
en: “He has the power to see The totality of phenomena undivided.

source: །དྲང་སྲོང་ཆེན་པོའི་ཡེ་ཤེས་སྟོབས། །ནམ་མཁའ་བཞིན་དུ་མཐའ་ཡས་པ།
en: The power of the great seers’ knowledge Is limitless as the heavens.

source: །སེམས་ཅན་གཅིག་གི་དོན་ཕྱིར་ཡང་། །བསྐལ་པ་རྒྱ་མཚོ་མཐའ་ཡས་པར། །འདུལ་བའི་དོན་ཕྱིར་བཞུགས་པས་ན། ། དེ་དག་སྙིང་རྗེ་དེ་འདྲའོ། །
en: “His compassion is such That in order to benefit even a single sentient being He will remain in the world for an endless ocean of eons To train him.

source: སེམས་ཅན་ཐམས་ཅད་གཞན་དང་གཞན། །དྲི་བ་རྒྱ་མཚོ་འདྲི་བྱེད་ཀྱང་། །
en: “There is a whole ocean of questions Sentient beings may ask one another.

source: དྲིས་ལན་གཅིག་གིས་ཚིམ་བྱེད་དེ། །
en: He satisfies them with a single answer.

source: མི་འཇིགས་པ་ནི་བསམ་མི་ཁྱབ། །
en: His confidence is inconceivable.

source: རྣམ་པ་ཐམས་ཅད་མཆོག་ལྡན་པ། །ཆོས་རྣམས་ཐམས་ཅད་ཐུགས་སུ་ཆུད། །
en: “His understanding is perfectly related To all aspects of all phenomena.

source: སངས་རྒྱས་ཆོས་རྣམས་མ་འདྲེས་པ། །ཐམས་ཅད་དུ་ནི་ཡེ་ཤེས་གཟིགས། །
en: The unique qualities of the buddhas Express their universal vision of knowledge.

source: དད་པ་ལ་ནི་རབ་གནས་པས། །སངས་རྒྱས་ཀུན་ཆོས་ཆོས་ཉིད་རྣམས།
en: “They are all inconceivable—This is the nature of all the qualities of the buddhas.

source: །བསམ་གྱིས་མི་ཁྱབ་འདི་དག་ལ། །དེ་དག་ཐམས་ཅད་དད་པར་བྱེད། །
en: They all have faith in this, And their faith is well founded.
